Ran Plan for dir: `terraform` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform plan -input=false -refresh -no-color -out \"/home/atlantis/.atlantis/repos/desafio-acs/eks-terraform/25/default/terraform/terraform-root-default.tfplan\"" in "/home/atlantis/.atlantis/repos/desafio-acs/eks-terraform/25/default/terraform": exit status 1
module.eks_network.data.aws_region.current: Reading...
module.eks_cluster.aws_iam_role.eks_cluster_role: Refreshing state... [id=desafio-aquarela-cluster-role]
module.eks_aws_load_balancer_controller.aws_iam_policy.eks_controller_policy: Refreshing state... [id=arn:aws:iam::833565098889:policy/desafio-aquarela-aws-load-balancer-controller]
module.eks_network.aws_eip.eks_ngw_eip_1b: Refreshing state... [id=eipalloc-04d8917391557c30d]
module.eks_aws_load_balancer_controller.data.aws_caller_identity.current: Reading...
module.eks_network.aws_eip.eks_ngw_eip_1a: Refreshing state... [id=eipalloc-0159dc3bcb63f782b]
module.eks_aws_load_balancer_controller.data.aws_region.current: Reading...
module.eks_managed_node_group.aws_iam_role.eks_mng_role: Refreshing state... [id=desafio-aquarela-mng-role]
module.eks_network.aws_vpc.eks_vpc: Refreshing state... [id=vpc-08b436880e0823f6f]
module.eks_admin_users.aws_iam_user.eks_admin["desafio_aquarela_samuel"]: Refreshing state... [id=desafio_aquarela_samuel]
module.eks_network.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.acm_wildcard.aws_acm_certificate.wildcard: Refreshing state... [id=arn:aws:acm:us-east-2:833565098889:certificate/02ef0c72-00b0-44b6-b075-e1a61423ad87]
module.eks_aws_load_balancer_controller.data.aws_region.current: Read complete after 1s [id=us-east-2]
module.eks_aws_load_balancer_controller.data.aws_caller_identity.current: Read complete after 1s [id=833565098889]
module.eks_admin_users.aws_iam_access_key.eks_admin_key["desafio_aquarela_samuel"]: Refreshing state... [id=AKIA4EFC2AOEUKZRCSM6]
module.eks_admin_users.aws_iam_user_policy.eks_user_control_plane_access["desafio_aquarela_samuel"]: Refreshing state... [id=desafio_aquarela_samuel:desafio_aquarela_samuel-eks-read-admin-access-samuel]
module.eks_cluster.aws_iam_role_policy_attachment.eks_cluster_role_attachment: Refreshing state... [id=desafio-aquarela-cluster-role/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
module.eks_managed_node_group.aws_iam_role_policy_attachment.eks_mng_role_attachment_cni: Refreshing state... [id=desafio-aquarela-mng-role/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
module.eks_managed_node_group.aws_iam_role_policy_attachment.eks_mng_role_attachment_ecr: Refreshing state... [id=desafio-aquarela-mng-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
module.eks_managed_node_group.aws_iam_role_policy_attachment.eks_mng_role_attachment_worker: Refreshing state... [id=desafio-aquarela-mng-role/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
module.eks_network.aws_internet_gateway.eks_igw: Refreshing state... [id=igw-023658afcc83879dd]
module.eks_network.aws_subnet.eks_subnet_private_1a: Refreshing state... [id=subnet-02a5e3f2afa9cbb5f]
module.eks_network.aws_subnet.eks_subnet_public_1b: Refreshing state... [id=subnet-084d6e95c89a9801a]
module.eks_network.aws_subnet.eks_subnet_public_1a: Refreshing state... [id=subnet-0dad75bb00fcf1dac]
module.eks_network.aws_subnet.eks_subnet_private_1b: Refreshing state... [id=subnet-0db279ed97c8e376c]
module.eks_network.aws_route_table.eks_public_route_table: Refreshing state... [id=rtb-0f5acbe36a7bbb74c]
module.eks_network.aws_nat_gateway.eks_ngw_1a: Refreshing state... [id=nat-0d33e0aa2fd745ad7]
module.eks_network.aws_nat_gateway.eks_ngw_1b: Refreshing state... [id=nat-0ad9195a7b60c678c]
module.eks_cluster.aws_eks_cluster.eks_cluster: Refreshing state... [id=desafio-aquarela-cluster]
module.eks_network.aws_route_table.eks_private_route_table_1a: Refreshing state... [id=rtb-037d9efba7ec434a4]
module.eks_network.aws_route_table.eks_private_route_table_1b: Refreshing state... [id=rtb-00b16f8759c1f9935]
module.eks_network.aws_route_table_association.eks_rtb_assoc_1b: Refreshing state... [id=rtbassoc-051caa542a7346354]
module.eks_network.aws_route_table_association.eks_rtb_assoc_1a: Refreshing state... [id=rtbassoc-0304fb4c16dde2b7e]
module.eks_network.aws_route_table_association.eks_rtb_assoc_priv_1a: Refreshing state... [id=rtbassoc-0200fe6a25c870d79]
module.eks_network.aws_route_table_association.eks_rtb_assoc_priv_1b: Refreshing state... [id=rtbassoc-0048a12ea6407d425]
module.eks_cluster.aws_security_group_rule.eks_cluster_sg_rule: Refreshing state... [id=sgrule-572044352]
module.eks_cluster.data.tls_certificate.eks_oidc_tls_certificate: Reading...
module.eks_admin_users.data.aws_eks_cluster.cluster: Reading...
module.eks_aws_load_balancer_controller.aws_iam_role.eks_controller_role: Refreshing state... [id=desafio-aquarela-aws-load-balancer-controller]
module.eks_managed_node_group.aws_eks_node_group.eks_managed_node_group: Refreshing state... [id=desafio-aquarela-cluster:desafio-aquarela-nodegroup]
module.eks_admin_users.data.aws_eks_cluster_auth.cluster: Reading...
module.eks_cluster.data.aws_iam_policy_document.ebs_csi_assume_role_policy: Reading...
module.eks_cluster.data.aws_iam_policy_document.ebs_csi_assume_role_policy: Read complete after 0s [id=299559562]
module.eks_admin_users.data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=desafio-aquarela-cluster]
module.eks_cluster.data.tls_certificate.eks_oidc_tls_certificate: Read complete after 0s [id=0a759b1370f2328d0bd5dd3ac81215f4c3398ef8]
module.eks_cluster.aws_iam_openid_connect_provider.eks_oidc: Refreshing state... [id=arn:aws:iam::833565098889:oidc-provider/oidc.eks.us-east-2.amazonaws.com/id/E2DFAE04C3ED74049A29FB3AFA417C96]
module.eks_admin_users.data.aws_eks_cluster.cluster: Read complete after 0s [id=desafio-aquarela-cluster]
module.eks_aws_load_balancer_controller.aws_iam_role_policy_attachment.eks_controller_role_attachment: Refreshing state... [id=desafio-aquarela-aws-load-balancer-controller/arn:aws:iam::833565098889:policy/desafio-aquarela-aws-load-balancer-controller]
module.eks_admin_users.data.kubernetes_config_map.aws_auth: Reading...
kubernetes_namespace.argocd: Refreshing state... [id=argocd]
module.eks_aws_load_balancer_controller.kubernetes_service_account.eks_controller_sa: Refreshing state... [id=kube-system/aws-load-balancer-controller]
module.eks_aws_load_balancer_controller.helm_release.eks_helm_controller: Refreshing state... [id=aws-load-balancer-controller]
helm_release.argocd: Refreshing state... [id=argocd]
module.eks_admin_users.data.kubernetes_config_map.aws_auth: Read complete after 0s [id=kube-system/aws-auth]
module.eks_admin_users.kubernetes_config_map_v1_data.aws_auth_update: Refreshing state... [id=kube-system/aws-auth]
kubectl_manifest.app_of_apps_infra: Refreshing state... [id=/apis/argoproj.io/v1alpha1/namespaces/argocd/applicationsets/app-of-apps-infra]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "cluster" {
      + id     = (known after apply)
      + name   = "desafio-aquarela-cluster"
      + region = (known after apply)
      + token  = (sensitive value)
    }

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 1200
      + values                     = [
          + <<-EOT
                nameOverride: argocd
                
                server:
                  ingress:
                    enabled: true
                    ingressClassName: alb
                    annotations:
                      alb.ingress.kubernetes.io/scheme: internet-facing
                      alb.ingress.kubernetes.io/listen-ports: '[{"HTTP":80},{"HTTPS":443}]'
                      alb.ingress.kubernetes.io/certificate-arn: arn:aws:acm:us-east-2:833565098889:certificate/02ef0c72-00b0-44b6-b075-e1a61423ad87
                      alb.ingress.kubernetes.io/target-type: ip
                      alb.ingress.kubernetes.io/ssl-redirect: "443"
                      alb.ingress.kubernetes.io/group.name: desafio-acs
                    hostname: "argocd.thesams.site"
                    path: /
                    pathType: Prefix
                
                  metrics:
                    enabled: false
                    serviceMonitor:
                      enabled: false
                      namespace: monitoring
                      additionalLabels:
                        release: monitoring
                
                repoServer:
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      namespace: monitoring
                      additionalLabels:
                        release: prometheus
                
                dex:
                  enabled: true
                
                controller:
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      namespace: monitoring
                      additionalLabels:
                        release: prometheus
                    rules:
                      enabled: true
                      additionalLabels: 
                        release: prometheus
                      namespace: monitoring
                      spec:
                      - alert: ArgoAppMissing
                        expr: |
                          absent(argocd_app_info) == 1
                        for: 15m
                        labels:
                          severity: critical
                        annotations:
                          summary: "[Argo CD] No reported applications"
                          description: >
                            Argo CD has not reported any applications data for the past 15 minutes which
                            means that it must be down or not functioning properly.  This needs to be
                            resolved for this cloud to continue to maintain state.
                      - alert: ArgoAppNotSynced
                        expr: |
                          argocd_app_info{sync_status!="Synced"} == 1
                        for: 12h
                        labels:
                          severity: warning
                        annotations:
                          summary: "[{{`{{$labels.name}}`}}] Application not synchronized"
                          description: >
                            The application [{{`{{$labels.name}}`}} has not been synchronized for over
                            12 hours which means that the state of this cloud has drifted away from the
                            state inside Git.
                
                configs:
                  params:
                    server.insecure: true
                    server.dex.server: http://argocd-dex-server:5556
                    dexserver.disable.tls: true
                    server.dex.server.strict.tls: false
                  cm:
                    url: https://argocd.thesams.site
                    dex.config:  |
                      connectors:
                      - type: github
                        id: github
                        name: GitHub
                        config:
                          clientID: ""
                          clientSecret: ""
                          orgs:
                          - name: desafio-acs
                
                applicationSet:
                  enabled: true
                  metrics:
                    enabled: true
                  ingress:
                    enabled: true
                    ingressClassName: alb
                    annotations:
                      alb.ingress.kubernetes.io/scheme: internet-facing
                      alb.ingress.kubernetes.io/listen-ports: '[{"HTTP":80},{"HTTPS":443}]'
                      alb.ingress.kubernetes.io/certificate-arn: arn:aws:acm:us-east-2:833565098889:certificate/02ef0c72-00b0-44b6-b075-e1a61423ad87
                      alb.ingress.kubernetes.io/target-type: ip
                      alb.ingress.kubernetes.io/ssl-redirect: "443"
                      alb.ingress.kubernetes.io/group.name: desafio-acs
                    hostname: "applicationset.thesams.site"
                    path: /
                    pathType: Prefix
            EOT,
        ]
      + verify                     = false
      + version                    = "8.2.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.eks_admin_users.kubernetes_config_map_v1_data.aws_auth_update will be updated in-place
  ~ resource "kubernetes_config_map_v1_data" "aws_auth_update" {
      ~ data          = {
          ~ "mapUsers" = <<-EOT
                - - "groups":
                    - "system:masters"
                    "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
                    "username": "desafio_aquarela_samuel"
                  - "groups":
                    - "system:masters"
                    "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
                    "username": "desafio_aquarela_samuel"
              + - "groups":
              +   - "system:masters"
              +   "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
              +   "username": "desafio_aquarela_samuel"
            EOT
        }
        id            = "kube-system/aws-auth"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks_aws_load_balancer_controller.helm_release.eks_helm_controller will be created
  + resource "helm_release" "eks_helm_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + set                        = [
          + {
              + name  = "clusterName"
              + value = "desafio-aquarela-cluster"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "serviceAccount.create"
              + value = "false"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "serviceAccount.name"
              + value = "aws-load-balancer-controller"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "vpcId"
              + value = "vpc-08b436880e0823f6f"
                # (1 unchanged attribute hidden)
            },
        ]
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.4.7"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.eks_cluster.aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name           = "coredns"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "desafio-aquarela-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + region               = "us-east-2"
      + tags_all             = (known after apply)
    }

  # module.eks_cluster.aws_eks_addon.ebs_csi_driver will be created
  + resource "aws_eks_addon" "ebs_csi_driver" {
      + addon_name               = "aws-ebs-csi-driver"
      + addon_version            = (known after apply)
      + arn                      = (known after apply)
      + cluster_name             = "desafio-aquarela-cluster"
      + configuration_values     = (known after apply)
      + created_at               = (known after apply)
      + id                       = (known after apply)
      + modified_at              = (known after apply)
      + region                   = "us-east-2"
      + service_account_role_arn = (known after apply)
      + tags_all                 = (known after apply)
    }

  # module.eks_cluster.aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name           = "kube-proxy"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "desafio-aquarela-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + region               = "us-east-2"
      + tags_all             = (known after apply)
    }

  # module.eks_cluster.aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name           = "vpc-cni"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "desafio-aquarela-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + region               = "us-east-2"
      + tags_all             = (known after apply)
    }

  # module.eks_cluster.aws_iam_role.ebs_csi_role will be created
  + resource "aws_iam_role" "ebs_csi_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "https://oidc.eks.us-east-2.amazonaws.com/id/E2DFAE04C3ED74049A29FB3AFA417C96:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "https://oidc.eks.us-east-2.amazonaws.com/id/E2DFAE04C3ED74049A29FB3AFA417C96:sub" = "system:serviceaccount:kube-system:ebs-csi-controller-sa"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "https://oidc.eks.us-east-2.amazonaws.com/id/E2DFAE04C3ED74049A29FB3AFA417C96"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "desafio-aquarela-ebs-csi-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks_cluster.aws_iam_role_policy_attachment.ebs_csi_attachment will be created
  + resource "aws_iam_role_policy_attachment" "ebs_csi_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverServiceRole"
      + role       = "desafio-aquarela-ebs-csi-role"
    }

Plan: 8 to add, 1 to change, 0 to destroy.

Warning: Deprecated attribute

  on modules/aws-load-balancer-controller/iam.tf line 11, in resource "aws_iam_role" "eks_controller_role":
  11:                 "Federated": "arn:aws:iam::${data.aws_caller_identity.current.account_id}:oidc-provider/oidc.eks.${data.aws_region.current.name}.amazonaws.com/id/${local.oidc}"

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 13 more similar warnings elsewhere)

Error: Unauthorized

  with kubernetes_namespace.argocd,
  on argocd.tf line 1, in resource "kubernetes_namespace" "argocd":
   1: resource "kubernetes_namespace" "argocd" {


Error: failed to create kubernetes rest client for read of resource: the server has asked for the client to provide credentials

  with kubectl_manifest.app_of_apps_infra,
  on argocd.tf line 17, in resource "kubectl_manifest" "app_of_apps_infra":
  17: resource "kubectl_manifest" "app_of_apps_infra" {


Error: Unauthorized

  with module.eks_aws_load_balancer_controller.kubernetes_service_account.eks_controller_sa,
  on modules/aws-load-balancer-controller/serviceaccount.tf line 1, in resource "kubernetes_service_account" "eks_controller_sa":
   1: resource "kubernetes_service_account" "eks_controller_sa" {


```
</details>

